---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAggregate.GetIFCAggregateIterator
source: html/fa84ad86-7874-4893-206f-41bf627ba3b3.htm
---
# Autodesk.Revit.DB.IFC.IFCAggregate.GetIFCAggregateIterator Method

Returns a IFCAggregateIterator that iterates through the collection.

## Syntax (C#)
```csharp
public IFCAggregateIterator GetIFCAggregateIterator()
```